#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+DATE 2019-02-14
#+TAGS: suite(s) classes(c) moments(m) data(d) algoritms(a) dcost(v)
#+TAGS: emacs(e) utils(u) strat(t) simul(i) vanny(o)
#+TODO: TODO | DONE
#+STARTUP: nologdone

** Tutorial 0: How to load the system (vrp-suite) with emacs
   Here we'll assume that the user is using emacs.  
   1. Clone the git repo in the folder =vrp= to the working directory
      For the rest of the tutorial, we assume that the name of the working directory is tmp/vrp.

      In that folder /tmp/vrp/ there should be two folders:
      - vrp-suite
      - neighborhood-generation

      #+begin_src shell :export both :results output
      ls /tmp/vrp
      #+end_src

      #+RESULTS:
      : neighborhood-generation
      : vrp-suite
   2. In the working directory (vrp) create the following two folders
      - src/
      - data/

      Up to this point, in the working directory there should be 4 folder:
      #+begin_src shell :export both :results output
      ls /tmp/vrp
      #+end_src

      #+RESULTS:
      : data
      : neighborhood-generation
      : src
      : vrp-suite
   3. Tangle the file /tmp/vrp-suite/vrp-suite.org
      Open the file /tmp/vrp-suite/vrp-suite.org in emacs and do =M-x org-babel-tangle=
   4. After the tangle
      we should have one more file in the working directory: vrp-emacs-utils.el.

      #+begin_src shell :export both :results output
      ls /tmp/vrp
      #+end_src

      #+RESULTS:
      : data
      : neighborhood-generation
      : src
      : vrp-emacs-utils.el
      : vrp-suite
   5. Add the following lines to your file .emacs
      After 2022-03-26 this is no longer needed.

      #+BEGIN_SRC emacs-lisp :results none :exports code
      (define-key org-mode-map (kbd "M-m") (make-sparse-keymap))
      (define-key lisp-mode-map (kbd "M-m M-o") (make-sparse-keymap))
      #+END_SRC
      That's to avoid errors in the next step.
   6. From emacs load /tmp/vrp/vrp-emacs-utils.el
      =M-x load-file /tmp/vrp/vrp-emacs-utils.el=
   7. Tangle all the files in the vrp-suite
      To do that, in emacs, change the current directory to vrp-suite, and execute =M-x vrp-tangle-all-files=

      There is an alternative approach...  We can open each org file in the folder and in each of them execute =M-x org-babel-tangle=.  It will take longer, but it should also work.
   8. Tangle all the files in the neigh-suite
      To do this
      1. tangle the file
         /tmp/vrp/neighborhood-generation/neigh-suite.org
      2. in emacs load the file /tmp/vrp/src/neigh-emacs-utils.el
      3. Execute =M-x neigh-tangle-all-files=
   9. From emacs fire up slime (=M-x slime=)
   10. In Slime, change the current directory to the working directory
       (this can be done by typing =,= in the REPL and then =cd= <RETURN>, and navigate to the working directory)
   11. In slime load the file src/vrp-load-files
      #+BEGIN_SRC lisp +n -r :results none :exports code 
      (load "src/vrp-load-files.lisp")
      #+END_SRC
   12. Change to the package vrp
      #+BEGIN_SRC lisp +n -r :results none :exports code 
      (in-package :vrp)
      #+END_SRC
      
      From here on, we are ready to work with the system, and that's what we'll do in the following tutorials.
***** basic-client
      The most basic element in this hierarchy is the =basic-client=, that only has one id.  The constructor is =(basic-client id)= and it receives the id.

      In the following snippet, we create two basic-clients each with a different id, and we print them.

      #+begin_src lisp :export both :results output
      (let* ((c1 (basic-client 1))
             (c2 (basic-client 2)))
        (format t "Client 1: ~a~%" c1)
        (format t "Client 2: ~a~%" c2))
      #+end_src

      #+RESULTS:
      : Client 1: <c:1>
      : Client 2: <c:2>
     
***** basic-cvrp-client

      The =basic-cvrp-client= is a client that has an id and a demand.  It is the most basic client that can be used in CVRP problem.  The constructor receives two arguments: the id and the demand.

      #+begin_src lisp :export both :results output
      (let* ((c1 (basic-cvrp-client 1 10))
             (c2 (basic-cvrp-client 2 15)))
        (format t "Client 1: ~a, with demand: ~a~%" c1 (demand c1))
        (format t "Client 2: ~a, with demand: ~a~%" c2 (demand c2)))
      #+end_src

      #+RESULTS:
      : Client 1: <c1: 10>, with demand: 10
      : Client 2: <c2: 15>, with demand: 15
***** basic-vehicle
      Again, the basic vehicle is a vehicle that has only one id.  It's constructor receives a number that will be the id.

      #+begin_src lisp :export both :results output
      (let* ((v1 (basic-vehicle 1))
             (v2 (basic-vehicle 2)))
        (format t "Vehicle 1: ~a~%" v1)
        (format t "Vehicle 2: ~a~%" v2))
      #+end_src

      #+RESULTS:
      : Vehicle 1: <v:1>
      : Vehicle 2: <v:2>

***** cvrp-vehicle

      The =cvrp-vehicle= class also has a capacity, and a (current) cargo that should also be passed to the constructor.  The =cargo= argument in the constructor is optional and defaults to 0.

      #+begin_src lisp :export both :results output
      (let* ((v1 (cvrp-vehicle 1 10 5))
             (v2 (cvrp-vehicle 2 15)))
        (format t "Vehicle 1: ~a, with cargo ~a and capacity ~a~%"
                v1
                (cargo v1)
                (capacity v1))
        (format t "Vehicle 2: ~a, with cargo ~a and capacity ~a~%"
                v2
                (cargo v2)
                (capacity v2)))
      #+end_src

      #+RESULTS:
      : Vehicle 1: <cv:1. 5/10>, with capacity: 10
      : Vehicle 2: <cv:2. 0/15>, with capacity:: 15

      In the =print-object= method, we can see the =id= of the vehicle and the (current) =cargo= separated from the =capacity= by a slash.
**** depot
     The class =basic-depot= only has one id, that defaults to 0 if it is not passed as an argument to the constructor.
     
      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (d2 (basic-depot 1)))
        (format t "depot 1 ~a, with id ~a~%" d1 (id d1))
        (format t "depot 2 ~a, with di ~a~%" d2 (id d2)))
      #+end_src


      #+RESULTS:
      : depot 1 <d:0>, with id 0
      : depot 2 <d:1>, with di 1

      You can verify in the previous code that we created the first depot without specifying the value of the id and it is set to 0, the default value.

      The classes for the depot can be found [[file:vrp-classes.org::*Depots][here]].
**** route
     The classes for the routes can be found [[file:vrp-classes.org::*Routes][here]].

     Here, we'll mention only the =basic-route= because we are only printing the objects.

     The class =basic-route= has a vehicle, a list with clients and a depot.  We can create a route by creating all the individual elements and putting them together in the basic-route class.

     The constructor for this class receives all the elements with named parameters.

     In the example, we'll create a route with 3 clients.

     #+begin_src lisp :export both :results output
     (let* ((d1 (basic-depot))
            (v1 (basic-vehicle 1))
            (c1 (basic-client 1))
            (c2 (basic-client 2))
            (c3 (basic-client 3))
            (r1 nil))
       ;; here we construct the route.
       (setf r1 (basic-route :id 1 :vehicle v1 :depot d1
                              :clients (list c1 c2 c3)))
       ;; and here we print it
       (format t "route 1 ~a~%" r1))
     #+end_src

     #+RESULTS:
     : route 1 <r1: <v:1> (<d:0>: (<c:1> <c:2> <c:3>))>

     In the next section we'll use several routes to create a solution.

***** creating a basic-solution

      The constructor for this class receives all the elements with named parameters.  The cost argument defaults to 0.

      In the example, we'll create a solution with two routes.

      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (v1 (basic-vehicle 1))
             (c1 (basic-client 1))
             (c2 (basic-client 2))
             (c3 (basic-client 3))
             (r1 (basic-route :id 1 :vehicle v1 :depot d1
                               :clients (list c1 c2)))
             (r2 (basic-route :id 2 :vehicle v1 :depot d1
                              :clients (list c3)))
             (s1 nil))
        ;; here we construct the solution.
        (setf s1 (basic-solution :id 1 :routes (list r1 r2)))
  
        ;; and here we print it
        (format t "solution: ~a~%" s1))
      #+end_src

      #+RESULTS:
      : solution: S1: (0)
      :   <r1: <v:1> (<d:0>: (<c:1> <c:2>))>
      :   <r2: <v:1> (<d:0>: (<c:3>))>
      :

      When we print the solution we can see it's id (after the S), the cost (in parentheses) after S1, and then each route on a line.

***** pretty-printing the solution
      In this section, we'll introduce a method to print a solution in a friendlier way.

      To do that we use the generic-function =pp-solution=.  This function receives a solution and a stream.  In this case, the stream will be t (the standard output stream).

      We'll use the solution from the previous section:
     
      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (v1 (basic-vehicle 1))
             (c1 (basic-client 1))
             (c2 (basic-client 2))
             (c3 (basic-client 3))
             (r1 (basic-route :id 1 :vehicle v1 :depot d1
                               :clients (list c1 c2)))
             (r2 (basic-route :id 2 :vehicle v1 :depot d1
                              :clients (list c3)))
             (s1 nil))
        ;; here we construct the solution.
        (setf s1 (basic-solution :id 1 :routes (list r1 r2)))

        ;; and here we print it
        (format t "This is the printed-solution:~%~a~%" s1)

        (format t "and this is the pretty-print version:~%")
        (pp-solution s1 t))
      #+end_src

      #+RESULTS:
      : This is the printed-solution:
      : S1: (0)
      :   <r1: <v:1> (<d:0>: (<c:1> <c:2>))>
      :   <r2: <v:1> (<d:0>: (<c:3>))>
      : 
      : and this is the pretty-print version:
      : S1:
      :     R1: (1, 2)
      :     R2: (3)

***** basic-problem

      The basic problem has an id, a depot and a list with clients.  

      The constructor for this class receives all the elements with named parameters.  

      In the example, we'll create a problem with 3 clients.

      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (c1 (basic-client 1))
             (c2 (basic-client 2))
             (c3 (basic-client 3))
             (p1 nil))
        ;; here we create the problem.
        (setf p1 (basic-problem :id 1
                                :clients (list c1 c2 c3)
                                :depot d1))

        ;; and here we print it
        (format t "Problem: ~a~%" p1))
      #+end_src

      #+RESULTS:
      : Problem: <P1.(<c:1> <c:2> <c:3>), <d:0>>

      This is a very basic problem and it is pretty useless.  In the next section we introduce the cvrp-problem.

***** cvrp-problem

      In the CVRP we have a set of clients a central depot, we know the distance between each pair of clients (and the depot), and we can assume an infinte number of vehicles, all of them with the same capacity.  Also, for each client we know its demand.

      The class cvrp-problem has an id, a list of clients (which should have a demand slot), a distance-matrix (with the distance between each pair of clients and the depot), and a capacity, that is the same for all the vehicles.

      The constructor for this class receives all the elements with named parameters.  

      In the example, we'll create a problem with 3 clients, all of them of type =basic-cvrp-client=

      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (c1 (basic-cvrp-client 1 10))
             (c2 (basic-cvrp-client 2 20))
             (c3 (basic-cvrp-client 3 30))
             (distance-matrix #2a((0 1 2 3)
                                  (1 0 4 3)
                                  (2 1 0 6)
                                  (3 8 6 0)))
             (capacity 30)
             (p1 nil))
        ;; here we create the problem.
        (setf p1 (cvrp-problem :id 1
                               :clients (list c1 c2 c3)
                               :depot d1
                               :distance-matrix distance-matrix
                               :capacity capacity))

        ;; and here we print it
        (format t "Problem: ~a~%" p1))
      #+end_src

      #+RESULTS:
      : Problem: <CVRP 1: 3 clients, capacity 30>

      With this problem and a solution we can evaluate the cost of the solutions.  We'll do that on the [[*Tutorial 2: evaluating solutions][Tutorial 2: evaluating solutions]], but first we'll present a more convenient way to create clients, solutions and problems.  We'll do that in the next section.
      
**** with-basic-clients
     We can use this macro when we want to create some basic-clients.  It receives a list with integers and creates symbols of the form cn, for each n in the list of integers.  All those symbols are bound to an instance of a basic-client with id n.

     For example, the code we used [[*basic-client][in the introduction to basic-clients]]:

     #+begin_src lisp :export both :results output
     (let* ((c1 (basic-client 1))
            (c2 (basic-client 2)))
       (format t "Client 1: ~a~%" c1)
       (format t "Client 2: ~a~%" c2))
     #+end_src

     #+RESULTS:
     : Client 1: <c:1>
     : Client 2: <c:2>

     can be rewritten with this macro as:

      #+begin_src lisp :export both :results output
      (with-basic-clients (1 2)
        (format t "Client 1: ~a~%" c1)
        (format t "Client 2: ~a~%" c2))
      #+end_src

      #+RESULTS:
      : Client 1: <c:1>
      : Client 2: <c:2>

      And we get the same results.  Actually, the macro expansion of the macro is exactly the previous code :-o
     
      #+begin_src lisp :export both :results output
      (LET* ((C1 (BASIC-CLIENT 1)) (C2 (BASIC-CLIENT 2)))
        (FORMAT T "Client 1: ~a~%" C1)
        (FORMAT T "Client 2: ~a~%" C2))
      #+end_src

      So, any time we need a list of basic-clients, the 'elegant' way to do it is to use the macro =with-basic-client= ;-).
     
**** with-basic-solution
     We can also create basic-solutions very easily using the macro =with-basic-solution=.  This macro receives a symbol and list with lists of integers, where each inner list represent a route, and binds the symbol to a basic solution with the routes described by the inner lists.

     Maybe the easiest way to understand it is to see it in action.  (No.  The best way to understand it is to read a good description, but apparently I'm not able to do that now :-P, so let's stick to the example.)

     Once again, I'm going to rewrite a previous example using the macro.  This is the code from the [[*creating a basic-solution][section]] where we introduced the basic-solution:

      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (v1 (basic-vehicle 1))
             (c1 (basic-client 1))
             (c2 (basic-client 2))
             (c3 (basic-client 3))
             (r1 (basic-route :id 1 :vehicle v1 :depot d1
                               :clients (list c1 c2)))
             (r2 (basic-route :id 2 :vehicle v1 :depot d1
                              :clients (list c3)))
             (s1 nil))
        ;; here we construct the solution.
        (setf s1 (basic-solution :id 1 :routes (list r1 r2)))
  
        ;; and here we print it
        (format t "solution: ~a~%" s1))
      #+end_src

      #+RESULTS:
      : solution: S1: (0)
      :   <r1: <v:1> (<d:0>: (<c:1> <c:2>))>
      :   <r2: <v:1> (<d:0>: (<c:3>))>
      :

      and this is the same code usith the macro =with-basic-solution=:

      #+begin_src lisp :export both :results output
      (with-basic-solution (s1 ((1 2) (3)))
        ;; let's print the solution
        (format t "solution: ~a~%" s1))
      #+end_src

      #+RESULTS:
      : solution: S1: (0)
      :   <r1: <v:1> (<d:0>: (<c:1> <c:2>))>
      :   <r2: <v:2> (<d:0>: (<c:3>))>
      : 
      
      Actually the macro =with-basic-solution= expands into a code that does exactly the same things that we did in the previous example, but it is a lot better when the computer writes the code for us :-P.

      As we said before, the basic-solution is not very useful to solve instances of the VRP, because we need more info.  However, it is useful to explore neighborhoods and analyze what happens in those neighborhoods, as long as we don't need to evaluate the solutions :-).

      The following macros help us to create problems and solutions than can be used to actually solve VRPs :-o.

**** with-basic-cvrp-problem
     In this section we present a macro to create instances of the class =cvrp-problem=.

     In the CVRP we have a distance-matrix, clients with demands and a capacity for all the vehicles.  There is a macro that allows us to create instances of this class very easily.  It receives a symbol, and the rest of the info required for the cvrp-problem, everything in the form of list.

     We'll rewrite the code in section [[*cvrp-problem][cvrp-problem]] using this macro.  The code in that section was:

      #+begin_src lisp :export both :results output
      (let* ((d1 (basic-depot))
             (c1 (basic-cvrp-client 1 10))
             (c2 (basic-cvrp-client 2 20))
             (c3 (basic-cvrp-client 3 30))
             (distance-matrix #2a((0 1 2 3)
                                  (1 0 4 3)
                                  (2 1 0 6)
                                  (3 8 6 0)))
             (capacity 30)
             (p1 nil))
        ;; here we create the problem.
        (setf p1 (cvrp-problem :id 1
                               :clients (list c1 c2 c3)
                               :depot d1
                               :distance-matrix distance-matrix
                               :capacity capacity))

        ;; and here we print it
        (format t "Problem: ~a~%" p1))
      #+end_src

      #+RESULTS:
      : Problem: <CVRP 1: 3 clients, capacity 30>

      If we use the macro, we would write:

      #+begin_src lisp :export both :results output
      (with-cvrp-problem (p1 :distances '((0 1 2 3)
                                          (1 0 4 3)
                                          (2 1 0 6)
                                          (3 8 6 0))
                             :demands '(10 20 30)
                             :capacity 30)

        ;; and here we print it
        (format t "Problem: ~a~%" p1)
        (format t "clients: ~a~%" (clients p1)))
      #+end_src

      #+RESULTS:
      : Problem: <CVRP 1: 3 clients, capacity 30>
      : clients: (<c1: 10> <c2: 20> <c3: 30>)

      
      In this case the distances is a list of lists and the demands is also a list.  This macro creates a depot with =id= 0, as many clients as the length of the =demands= list, named from c1 to cn, where n is the length of that list.  

**** with-basic-cvrp-solution

     In this section we create an instance of =basic-cvrp-solution=.  A cvrp-basic-solution is a solution that can be evaluated to compute its cost.  The difference with the basic-solution is that the clients are instances of =basic-cvrp-client= and the routes are instances of =route-for-simulation=.  

     But, thanks to the macro we can ignore those implementation details, as the macro takes care of them for us.

     The macro is similar to =with-basic-solution= in the sense that it receives a list of lists with the description of the routes, but it also receives an instance of =cvrp-problem=.

     Here is the example:

      #+begin_src lisp :export both :results output
      (with-cvrp-problem (p1 :distances '((0 1 2 3)
                                          (1 0 4 3)
                                          (2 1 0 6)
                                          (3 8 6 0))
                             :demands '(10 20 30)
                             :capacity 30)
        (with-basic-cvrp-solution (s1 ((1 2) (3)) p1)

         ;; and here we pretty print it
          (format t "Solution:~%")
          (pp-solution s1 t) (terpri)

          (format t "The raw solution:~%~a~%" s1)))
      #+end_src

      #+RESULTS:
      #+begin_example
      Solution:
      S1:
	  R1: (1, 2)
	  R2: (3)

      The raw solution:
      CVRP_S1: (0)
	<r1: <cv:1. 0/30> (<d:0>: (<c1: 10> <c2: 20>))>
	<r2: <cv:2. 0/30> (<d:0>: (<c3: 30>))>

      #+end_example
      
      The command =(terpri)= inserts a new line to the optional stream (that defaults to t).

      We can see in the raw solution the demand of each client, and the capacity of the vehicles.  Those values are taken from the problem passed as the third argument.

      The code and some documentation for this macro can be found [[file:vrp-classes.org::#macro:with-basic-cvrp-solution][here]].

      This is a simple introduction to the basic elements in the system.  In the next tutorial we'll show how to evaluate the solutions.

*** actions
    The definition of the action classes can be found in the section [[file:vrp-classes.org::*Actions][Actions]].

    An action is an object designed to make some computations.  There are two types of actions.  The first type is used to compute the cost of a given solution and the second one is used the compute the delta-cost between a solution and a neighbor.

    In this section we'll deal with the first type.  We'll use the only action we have now in the system, and it computes the cost of a given solution for a given CVRP problem.

    The name of the class is =basic-cvrp-action= and it computes the total distance travelled by the vehicles plus a penalty due to excess of cargo in the vehicles on each route.  The penalty is computed as a the unfeasibility of the route times a factor that defaults to 1000.  The unfeasibility of a route is computed as the sum of the demands of the clients on that route minus the capacity of the vehicle, or zero if that value is negative:

    $\displaystyle \max\{0, \sum_{i\in r}{d_i} - C_v\}$,

    where $r$ is the route, $i$ is the clients of the route, $d_i$ is client $i$'s demand, and $C_v$ is the capacity of the vehicle.
    

    For instance if clients =c1=, =c2= and =c3= have demand 10 and vehicle's capacity is 20, then the unfeasibility of the route is 10.  However, if the capacity were 40, the unfeasibility would be 0.

    The constructor for this class is =basic-cvrp-action=, and receives 5 named parameters:
    - id, defaults to 1,
    - penalty-factor, defaults to 1000,
    - total-penalty, defaults to 0,
    - capacity-violation, defaults to 0 (this is the "unfeasibility"),
    - current-distance, defaults to 0, and
    - total-distance, also defaulting to 0.

    Of all those parameters, usually we only need to modify the penalty-factor in order to tune it to our current problem.

    The code for creating the action is the follwing:

     #+begin_src lisp :export both :results output
     (let* ((a1 (basic-cvrp-action))
            (a2 (basic-cvrp-action :id 2))
            (a3 (basic-cvrp-action :id 3 :penalty-factor 3000)))
       (format t "Action 1: ~a~%" a1)
       (format t "Action 2: ~a~%" a2)
       (format t "Action 3: ~a~%" a3))
     #+end_src

     #+RESULTS:
     : Action 1: <a_cvrp1. d: 0, p: 0>
     : Action 2: <a_cvrp2. d: 0, p: 0>
     : Action 3: <a_cvrp3. d: 0, p: 0>
    

    When we print the actions we only see the two values that we'll be interested in after the evaluation of a solution: the =total-distance= and the =total-penalty=.  As we just created the actions, they have the defaults values.

    Let's also print the =penalty-factor= for each of them:
   
     #+begin_src lisp :export both :results output
     (let* ((a1 (basic-cvrp-action))
            (a2 (basic-cvrp-action :id 2))
            (a3 (basic-cvrp-action :id 3 :penalty-factor 3000)))
       (format t "Action 1: ~a~%" a1)
       (format t "Action 2: ~a~%" a2)
       (format t "Action 3: ~a~%" a3)

       (terpri) ;; an empty line

       (format t "Penalty-factor in Action 1: ~a~%" (penalty-factor a1))
       (format t "Penalty-factor in Action 2: ~a~%" (penalty-factor a2))
       (format t "Penalty-factor in Action 3: ~a~%" (penalty-factor a3)))
     #+end_src

     #+RESULTS:
     : Action 1: <a_cvrp1. d: 0, p: 0>
     : Action 2: <a_cvrp2. d: 0, p: 0>
     : Action 3: <a_cvrp3. d: 0, p: 0>
     : 
     : Penalty-factor in Action 1: 1000
     : Penalty-factor in Action 2: 1000
     : Penalty-factor in Action 3: 3000

     As expected, =action1= and =action2= have =penalty-factor= 1000, and =action3= has =penalty-factor= 3000.

     Once we have created a action we can use to compute the cost of a solution for a given problem.  We'll do that in the next section.
*** using actions to evaluate solutions
    Once we have a solution, a problem and an action we should use the function =simulate-solution= that receives those parameters as shown in the next code:

     #+begin_src lisp :export both :results output
     (with-cvrp-problem (p1 :distances '((0 1 2 3 5)
                                         (1 0 4 5 6)
                                         (2 4 0 6 7)
                                         (3 5 6 0 8)
                                         (5 6 7 8 0))
                            :demands '(30 20 40 50)
                            :capacity 50)
       (with-basic-cvrp-solution (s1 ((1 2)
                                      (3 4))
                                     p1)

         (let* ((action (basic-cvrp-action)))

           (format t "~a~%"
                   (simulate-solution s1 p1 action)))))
     #+end_src

     #+RESULTS:
     : NIL
    
    If we execute that code we just get NIL because the method =simulate-solution= does not returns a value.  Actually, the results of the simulation are stored in the action's corresponding slots.  We can see them in the next code: 

     #+begin_src lisp :export both :results output
     (with-cvrp-problem (p1 :distances '((0 1 2 3 5)
                                         (1 0 4 5 6)
                                         (2 4 0 6 7)
                                         (3 5 6 0 8)
                                         (5 6 7 8 0))
                            :demands '(30 20 40 50)
                            :capacity 50)
       (with-basic-cvrp-solution (s1 ((1 2)
                                      (3 4))
                                     p1)

         (let* ((action (basic-cvrp-action)))

           (simulate-solution s1 p1 action)

           (format t "solution distance: ~a~%" (total-distance action))
           (format t "solution penalty: ~a~%" (total-penalty action)))))
     #+end_src

     #+RESULTS:
     : solution distance: 23
     : solution penalty: 40000

     Here we can see that the total distance is 23, but the the penalty is 40000, due to the demand excess in the second route.

     If we run that code with a diferent (and feasible) solution we get the following results:

     #+begin_src lisp :export both :results output
     (with-cvrp-problem (p1 :distances '((0 1 2 3 5)
                                         (1 0 4 5 6)
                                         (2 4 0 6 7)
                                         (3 5 6 0 8)
                                         (5 6 7 8 0))
                            :demands '(30 20 40 50)
                            :capacity 50)
       (with-basic-cvrp-solution (s1 ((1 2)
                                      (3)
                                      (4))
                                     p1)

         (let* ((action (basic-cvrp-action)))

           (simulate-solution s1 p1 action)

           (format t "solution distance: ~a~%" (total-distance action))
           (format t "solution penalty: ~a~%" (total-penalty action)))))
     #+end_src

     #+RESULTS:
     : solution distance: 23
     : solution penalty: 0

     In this case, the penalty is 0, and that means that the solution is feasible ;-).

     However, after we execute that code, the cost slot in the solution is not modified.  It is up to the user to update that value if that is desired.  This is shown in the next snippet.
     
     #+begin_src lisp :export both :results output
     (with-cvrp-problem (p1 :distances '((0 1 2 3 5)
                                         (1 0 4 5 6)
                                         (2 4 0 6 7)
                                         (3 5 6 0 8)
                                         (5 6 7 8 0))
                            :demands '(30 20 40 50)
                            :capacity 50)
       (with-basic-cvrp-solution (s1 ((1 2)
                                      (3)
                                      (4))
                                     p1)

         (let* ((action (basic-cvrp-action)))

           (simulate-solution s1 p1 action)

           (format t "After simulation but before setting the cost~%")
           (format t "solution cost: ~a.~%" (cost s1))
           ;; The cost is 0 because it has not been set, yet
      
           (setf (cost s1) (+ (total-distance action)
                              (total-penalty action)))
      
           (format t "After setting the cost~%")
           (format t "solution cost: ~a.~%" (cost s1)))))
     #+end_src

     #+RESULTS:
     : After simulation but before setting the cost
     : solution cost: 0.
     : After setting the cost
     : solution cost: 23.

*** the problem and the initial solution
    For the problem and the initial solution we'll use the corresponding macros.
    
      #+begin_src lisp :export both :results output
      (with-cvrp-problem (p1 :distances '((0 1 2 3)
                                          (1 0 4 3)
                                          (2 1 0 6)
                                          (3 8 6 0))
                             :demands '(10 20 30)
                             :capacity 30)
        (with-basic-cvrp-solution (s1 ((1 2) (3)) p1)


          ;; here we have a solution called s1
          ;; and a problem called p1.
          ;; with them we can do anything we want
          ;; for instance, we can print it.

         ;; and here we pretty print it
          (format t "Solution:~%")
          (pp-solution s1 t) (terpri)

          (format t "The raw solution:~%~a~%" s1)

          ))
      #+end_src

      #+RESULTS:
      #+begin_example
      Solution:
      S1:
	  R1: (1, 2)
	  R2: (3)

      The raw solution:
      CVRP_S1: (0)
	<r1: <cv:1. 0/30> (<d:0>: (<c1: 10> <c2: 20>))>
	<r2: <cv:2. 0/30> (<d:0>: (<c3: 30>))>

      #+end_example

*** the working-copy and the empty list
    Once we have the problem and the solution we can add a working-copy and an empty list, using a let.

    Before we can do anything with the working-copy we need to initialize it.  We must do that with the function  =prepare-solution-for-neighborhood-exploration=.
    
      #+begin_src lisp :export both :results output
      (with-cvrp-problem (p1 :distances '((0 1 2 3 4)
                                          (1 0 4 3 2)
                                          (2 1 0 6 1)
                                          (3 8 6 0 3)
                                          (4 2 1 3 0))
                             :demands '(10 20 30 10)
                             :capacity 30)
        (with-basic-cvrp-solution (s1 ((1 2) (3 4)) p1)


          ;; here we have a solution called s1
          ;; and a problem called p1.
          ;; with them we can do anything we want
          ;; for instance, we can print it.
          (let* ((working-copy (basic-working-copy s1))
                 (ops-list nil))

            ;; here we have a working-copy
            ;; and the ops-list variable


            ;; but before we can use any working-copy
            ;; we need to initialize it
            ;; we can de that with

            (prepare-solution-for-neighborhood-exploration working-copy)

            ;; now we can print it

            (pp-solution working-copy t) (terpri)

            ;; and the empty list:
            (format t "ops-list: ~a~%" ops-list)

            )))
      #+end_src

      #+RESULTS:
      : S1:
      :     R1: (1, 2)
      :     R2: (3, 4)
      : 
      : ops-list: NIL

      After that, we are ready to explore a neighborhood.

*** exploring the neighborhood rarb
    Once the working-copy is initialized, we can explore any neighborhood we want using the exploration macros.

    For this first example, we'll use the criterion rarb that means:

    - select route r1
    - select client c1 from r1
    - select route r2
    - insert client c1 into r2

    We can describe that criterion using the neighborhood macros:

    - doselect-route
    - doselect-client
    - doinsert-client

    Each of those macros receives the arguments it needs, and a working-copy:

    - doselect-route: r
      r is a symbol where we'll store the current route.
    - doselect-client: c, r
      With c will denote the client selected in this operation.
      r is the route from which we should select the client.
    - doinsert-client: c, r
      c is the client that should be inserted, and
      r is the route where we should insert it.

    Using these macros, we can describe any neighborhood we want.  In the case of rarb we should write it as:

    #+begin_src lisp
    (doselect-route (r1 working-copy)
      (doselect-client (c r1 working-copy)
        (doselect-route (r2 working-copy)
          (doinsert-client (c r2 working-copy)

            ))))
    #+end_src

    Each call to a macro is nested in the previous call to access all the variables and parameters used there.  Each of those macros pushes the corresponding operation to the variable =ops-list=, and all of them should be called after the working-copy has been initialized.

    Let's see them in action:

    
    #+begin_src lisp :export both :results output
    (with-cvrp-problem (p1 :distances '((0 1 2 3 4)
                                        (1 0 4 3 2)
                                        (2 1 0 6 1)
                                        (3 8 6 0 3)
                                        (4 2 1 3 0))
                           :demands '(10 20 30 10)
                           :capacity 30)
      (with-basic-cvrp-solution (s1 ((1 2) (3 4)) p1)


        ;; here we have a solution called s1
        ;; and a problem called p1.
        ;; with them we can do anything we want
        ;; for instance, we can print it.
        (let* ((working-copy (basic-working-copy s1))
               (ops-list nil))

          ;; here we have a working-copy
          ;; and the ops-list variable


          ;; but before we can use any working-copy
          ;; we need to initialize it
          ;; we can de that with

          (prepare-solution-for-neighborhood-exploration working-copy)

          ;; here we can use the macros

          (doselect-route (r1 working-copy)
            (doselect-client (c r1 working-copy)
              (doselect-route (r2 working-copy)
                (doinsert-client (c r2 working-copy)

                  ;; here, in the variable ops-list
                  ;; we have the operations that define
                  ;; the current neighbor, in reversed order
                  ;; let's print it
                  (format t "~%ops-list for current-neighbor: ~a~%" ops-list)
              
                  ;; let's print it reversed
                  (format t "reversed neighbor operations:  ~a~%" (reverse ops-list))

                  )))))))
    #+end_src

    #+RESULTS:
    #+begin_example

    ops-list for current-neighbor: (<op:b 1 1 0> <op:a 1 1 0>)
    reversed neighbor operations:  (<op:a 1 1 0> <op:b 1 1 0>)

    ops-list for current-neighbor: (<op:b 1 2 0> <op:a 1 1 0>)
    reversed neighbor operations:  (<op:a 1 1 0> <op:b 1 2 0>)

    ops-list for current-neighbor: (<op:b 2 1 0> <op:a 1 1 0>)
    reversed neighbor operations:  (<op:a 1 1 0> <op:b 2 1 0>)

    ops-list for current-neighbor: (<op:b 2 2 0> <op:a 1 1 0>)
    reversed neighbor operations:  (<op:a 1 1 0> <op:b 2 2 0>)

    ops-list for current-neighbor: (<op:b 2 3 0> <op:a 1 1 0>)
    reversed neighbor operations:  (<op:a 1 1 0> <op:b 2 3 0>)

    ops-list for current-neighbor: (<op:b 1 1 0> <op:a 1 2 0>)
    reversed neighbor operations:  (<op:a 1 2 0> <op:b 1 1 0>)

    ops-list for current-neighbor: (<op:b 1 2 0> <op:a 1 2 0>)
    reversed neighbor operations:  (<op:a 1 2 0> <op:b 1 2 0>)

    ops-list for current-neighbor: (<op:b 2 1 0> <op:a 1 2 0>)
    reversed neighbor operations:  (<op:a 1 2 0> <op:b 2 1 0>)

    ops-list for current-neighbor: (<op:b 2 2 0> <op:a 1 2 0>)
    reversed neighbor operations:  (<op:a 1 2 0> <op:b 2 2 0>)

    ops-list for current-neighbor: (<op:b 2 3 0> <op:a 1 2 0>)
    reversed neighbor operations:  (<op:a 1 2 0> <op:b 2 3 0>)

    ops-list for current-neighbor: (<op:b 1 1 0> <op:a 2 1 0>)
    reversed neighbor operations:  (<op:a 2 1 0> <op:b 1 1 0>)

    ops-list for current-neighbor: (<op:b 1 2 0> <op:a 2 1 0>)
    reversed neighbor operations:  (<op:a 2 1 0> <op:b 1 2 0>)

    ops-list for current-neighbor: (<op:b 1 3 0> <op:a 2 1 0>)
    reversed neighbor operations:  (<op:a 2 1 0> <op:b 1 3 0>)

    ops-list for current-neighbor: (<op:b 2 1 0> <op:a 2 1 0>)
    reversed neighbor operations:  (<op:a 2 1 0> <op:b 2 1 0>)

    ops-list for current-neighbor: (<op:b 2 2 0> <op:a 2 1 0>)
    reversed neighbor operations:  (<op:a 2 1 0> <op:b 2 2 0>)

    ops-list for current-neighbor: (<op:b 1 1 0> <op:a 2 2 0>)
    reversed neighbor operations:  (<op:a 2 2 0> <op:b 1 1 0>)

    ops-list for current-neighbor: (<op:b 1 2 0> <op:a 2 2 0>)
    reversed neighbor operations:  (<op:a 2 2 0> <op:b 1 2 0>)

    ops-list for current-neighbor: (<op:b 1 3 0> <op:a 2 2 0>)
    reversed neighbor operations:  (<op:a 2 2 0> <op:b 1 3 0>)

    ops-list for current-neighbor: (<op:b 2 1 0> <op:a 2 2 0>)
    reversed neighbor operations:  (<op:a 2 2 0> <op:b 2 1 0>)

    ops-list for current-neighbor: (<op:b 2 2 0> <op:a 2 2 0>)
    reversed neighbor operations:  (<op:a 2 2 0> <op:b 2 2 0>)
    #+end_example

      And this should be enough: to explore a neighborhood use the approriate macros and in the body of those macros, do whatever you want, for instance, evaluate the solutions.

      Here is a list of all the macros available in 2021-03-17.  In the following list, wc is the working copy, r is in the positions where a route is expected, c, c1 and c2 are in positions where clients are expected, s2 s1 and s2 are in positions where a subroute is expected.

      - doselect-route (r wc)
      - doselect-client (c r wc)
      - doinsert-client (c r wc)
      - doswap-clients (c1 c2 wc)
      - doselect-subroute (s r wc)
      - doinsert-subroute (s r wc)
      - doreverse-subroute (s wc)
      - doswap-subroutes (s1 s2 wc)

      The operation reverse-subroute should be used after the subroute has been selected, and before it is inserted.


** Solutions: properties and pretty-printing them

   A basic solution has
   - an id
   - a list with routes
   - a cost

   The easiest way to use a solution is to use the macro =with-basic-solution= like this:

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (print s1))
    #+END_SRC

    #+RESULTS:
    : 
    : S1: (0)
    :   <r1: <v:1> (<d:0>: (<c:1> <c:2> <c:3>))>
    :   <r2: <v:2> (<d:0>: (<c:4> <c:5>))>
    :   <r3: <v:3> (<d:0>: (<c:6> <c:7> <c:8>))>
    :  

    What we got as the result of the evaluation of the previous code is the what the print-object method prints.

    In the next example, we'll print all the properties of the solution:

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (bformat t "Printing the properties of the solution")
  
      (format t "id: ~a~%" (id s1))
      (loop for r in (routes s1)
            for i from 1
            do (format t "route ~a: ~a~%" i r))
      (format t "costs: ~a~%" (cost s1)))
    #+END_SRC
     
    What we see in the print-object of the route: 

    <r1: <v:1> (<d:0>: (<c:1> <c:2> <c:3>))>

    - r1 :: r stands for route, and the 1 is the id.
    - <v:1> :: is the print-object of the basic vehicle.  v stand for vehicle and 1 is the id of the vehicle.
    - <d:0> :: is the depot (0 is the id)
    - <c:i> :: are the basic-clients.  the number is the id.

    Cost is 0 because that's the default value and we haven't changed that.

    There is a better way to print a solution using the function pp-solution:

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
       (with-basic-solution (s1 ((1 2 3)
                                 (4 5)
                                 (6 7 8)))
         ;; code here
         ;; where you car reference a basic-solution s1
         ;; for instance, we can just print it
         (bformat t "Pretty printing a solution")
         (pp-solution s1 t))
    #+END_SRC

    #+RESULTS:
    : ============================
    :  Pretty printing a solution
    : ============================
    : 
    : S1:
    :     R1: (1, 2, 3)
    :     R2: (4, 5)
    :     R3: (6, 7, 8)
     
    This is a (better?) way to print the solution, if you are not interested in other properties.
***** creating the operation
      The class select-client has the same slots as neighborhood-operation: route, position and index, and the constructor is: op-select-client.

      So we can make something like:

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
           (with-basic-solution (s1 ((1 2 3)
                                     (4 5)
                                     (6 7 8)))

             (let* ((op1 (op-select-client 1 2 0)))

               (bformat t "Creating a select-client-operation")

              (format t "operation: ~a~%" op1)))
     #+END_SRC

     #+RESULTS:
     : ====================================
     :  Creating a select-client-operation
     : ====================================
     : 
     : operation: <op:a 1 2 0>


     In this case, the output of the print-object method is:
     - a :: to represent the operation select-client
     - 1 :: is the route from where the selection should be made
     - 2 :: is the position in the route
     - 0 :: is the index of the operation.

     An so far, we have an operation, but we haven't done anything with it yet :-(.  In the next section we'll modify the solution :-o.

***** creating the solution
      This class is very similar to the select-client operation and it has the same slots: route, position, and index.  In this case, the index indicates what client to insert (from the ones that were selected).

      We can create the operation with op-insert-client
       
      #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
      (with-basic-solution (s1 ((1 2 3)
                                (4 5)
                                (6 7 8)))

        (let* ((op1 (op-insert-client 1 2 0)))

          (bformat t "Creating a select-client-operation")

          (format t "operation: ~a~%" op1)))
     #+END_SRC

     #+RESULTS:
     : ====================================
     :  Creating a select-client-operation
     : ====================================
     : 
     : operation: <op:b 1 2 0>

     In this case, in the print-object of the operation we can also see the route, the position and the index, and the letter b, that represents the insert-client operation.  Important: to create the operation we don't need a solution, or a working-copy, or a previous select-client operation.  We can create as many operations as we want, but if we want to simulate them, we'll need all those things.

**** get-simpler-operations-from
      There is a function called =get-simpler-operations-from= that receives a "compound operation" and returns a list with the basic-operations that form it.

      For example, let's see the simpler operations that we can get from the swap-clients operations.

     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3)
                               (4 5)
                               (6 7 8)))
       (bformat t "Creating a basic-working-copy")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* ((op1 (op-select-client 1 2 0)) ;; the selection
                (op2 (op-select-client 3 2 1)) ;; the insertion
                (op3 (op-swap-clients 0 1)) ;; the swap
                ;; it only receives the indices of the
                ;; selections that should be swapped
                (simpler-ops-for-swap nil)
                )

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "Now the working-copy:~%")
          (pp-solution wc t)
          ;; let's simulate the first operation
          (format t "Let's simulate the first selection (check that the 2 is missing):~%")
          (simulate-neighborhood-operation op1 wc)
          (pp-solution wc t)

          (format t "Now let's simulate the second selection:~%")
          ;; the simulation of the second operation
          (simulate-neighborhood-operation op2 wc)
          (pp-solution wc t)

          (format t "Now let's simulate the swap~%")
          (setf simpler-ops-for-swap
                (get-simpler-operations-from op3 wc))
          ;; let's see those operations
          (format t "First insertion from swap: ~a~%"
                  (first simpler-ops-for-swap))
          (format t "Second insertion from swap: ~a~%"
                  (second simpler-ops-for-swap))
          ;; now that we have the simpler operations
          ;; let's simulate them
          ;; the first insertion
          (simulate-neighborhood-operation
           (first simpler-ops-for-swap) wc)
          ;; the second insertion
          (simulate-neighborhood-operation
           (second simpler-ops-for-swap) wc)

     
          (format t "Solution after the swap:~%")
          (pp-solution wc t)
         )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now the working-copy:
      S1:
	  R1: (1, 2, 3)
	  R2: (4, 5)
	  R3: (6, 7, 8)
      Let's simulate the first operation (check that the 2 is missing):
      S1:
	  R1: (1, 3)
	  R2: (4, 5)
	  R3: (6, 7, 8)
      Now let's simulate the second operation:
      S1:
	  R1: (1, 3)
	  R2: (4, 5)
	  R3: (6, 8)
      Now let's simulate the swap
      First insertion from swap: <op:b 1 2 1>
      Second insertion from swap: <op:b 3 2 0>
      Solution after the swap:
      S1:
	  R1: (1, 7, 3)
	  R2: (4, 5)
	  R3: (6, 2, 8)
      #+end_example

      So, if we have a compound operation (that is, if we have a non basic operation) we need to call first the function =get-simpler-operations-from= and then simulate all the operations in that list.

      Then the question becomes: which operations are simple and which are not?  Because the simpler ones we just simulate them, and the compound ones, we need to decompose them first :-(.

      The good news is: it doesn't matter!  You can call the function =get-simpler-operations-from= even with the simpler operations.  In that case, that method returns the simpler operation.

      For instance, let's get the simpler-operations from a select-client and from a swap-clients.

      #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
      (with-basic-solution (s1 ((1 2 3)
                                (4 5)
                                (6 7 8)))
        (bformat t "Creating a basic-working-copy")
        (let* ((wc (basic-working-copy s1)
                 ;; we just created the working-copy
                    ))

          (let* ((op1 (op-select-client 1 2 0))
                 (op2 (op-select-client 3 2 1))
                 (op3 (op-swap-clients 0 1)))

            ;; let's initialize the working-copy
            (prepare-solution-for-neighborhood-exploration wc)

            (format t "Now let's get the simpler ops from select-client:~%")

            (format t "simpler-ops-from ~a:~%  ~a~2%"
                    op1 (get-simpler-operations-from op1 wc))

            (format t "Now let's get the simpler ops from swap-clients:~%")

            ;; to get the simpler operations from a swap
            ;; we need to simulate the previous operations

            (dolist (op (list op1 op2))
              (simulate-neighborhood-operation op wc))

            (format t "simpler-ops-from ~a:~%  ~a~%"
                    op3
                    (get-simpler-operations-from op3 wc))

      
            )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now let's get the simpler ops from select-client:
      simpler-ops-from <op:a 1 2 0>:
	(<op:a 1 2 0>)

      Now let's get the simpler ops from swap-clients:
      simpler-ops-from <op:s 0 1>:
	(<op:b 1 2 1> <op:b 3 2 0>)
      #+end_example

**** the proper way to simulate any operation
     With the information we have so far, the proper way to simulate an operation op should be
     1. get all the simpler-operations for that op
     2. simulate all the simpler-ops

     That can be done like this:
     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3)
                               (4 5)
                               (6 7 8)))
       (bformat t "Creating a basic-working-copy")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* ((op1 (op-select-client 1 2 0)) ;; the selection
                (op2 (op-select-client 3 2 1)) ;; the insertion
                (op3 (op-swap-clients 0 1)) ;; the swap
                ;; it only receives the indices of the
                ;; selections that should be swapped
                )

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "Now the working-copy:~%")
          (pp-solution wc t)
          ;; let's simulate the solution
          (format t "Let's simulate the solution (check that the 2 is missing):~%")
          ;; instead of simulating the operation
          ;; let's simulate all the simpler-ops
          (dolist (op (get-simpler-operations-from op1 wc))
            (simulate-neighborhood-operation op wc))
     
          (pp-solution wc t)

          (format t "Now let's simulate the second selection:~%")
          ;; the simulation of the operation
          (dolist (op (get-simpler-operations-from op2 wc))
            (simulate-neighborhood-operation op wc))
          (pp-solution wc t)

          (format t "Now let's simulate the swap~%")
          (dolist (op (get-simpler-operations-from op3 wc))
            (simulate-neighborhood-operation op wc))


          (format t "Solution after the swap:~%")
          (pp-solution wc t)
         )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now the working-copy:
      S1:
          R1: (1, 2, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Let's simulate the solution (check that the 2 is missing):
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Now let's simulate the second selection:
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 8)
      Now let's simulate the swap
      Solution after the swap:
      S1:
          R1: (1, 7, 3)
          R2: (4, 5)
          R3: (6, 2, 8)
      #+end_example
** Undoing an operation
   We also have a method to undo an operation.  To undo an operation means to restore the working-copy to the state it was before the simulation of the operation.  This function is called =undo-neighborhood-operation=.  Let's see how it works:

     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3)
                               (4 5)
                               (6 7 8)))
       (bformat t "Creating a basic-working-copy")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* ((op1 (op-select-client 1 2 0)) ;; the selection
                )

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "Now the working-copy:~%")
          (pp-solution wc t)
          ;; let's simulate the operation
          (format t "Let's simulate the solution (check that the 2 is missing):~%")
          ;; instead of simulating the operation
          ;; let's simulate all the simpler-ops
          (dolist (op (get-simpler-operations-from op1 wc))
            (simulate-neighborhood-operation op wc))

          (pp-solution wc t)

          ;; now, let's undo that operation
          (undo-neighborhood-operation op1 wc)
          (format t "Solution after the undo:~%")
          (pp-solution wc t)
         )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now the working-copy:
      S1:
          R1: (1, 2, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Let's simulate the solution (check that the 2 is missing):
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Solution after the undo:
      S1:
          R1: (1, 2, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      #+end_example

      *Important note: the operations should be undone in the reverse order as they were simulated, and that order is important.*

      Let's see that in the case of the swap-clients

     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3)
                               (4 5)
                               (6 7 8)))
       (bformat t "Creating a basic-working-copy")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* ((op1 (op-select-client 1 2 0)) ;; the selection
                (op2 (op-select-client 3 2 1)) ;; the insertion
                (op3 (op-swap-clients 0 1)) ;; the swap
                ;; it only receives the indices of the
                ;; selections that should be swapped
                )

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "Now the working-copy:~%")
          (pp-solution wc t)
          ;; let's simulate the solution
          (format t "Let's simulate the solution (check that the 2 is missing):~%")
          ;; instead of simulating the operation
          ;; let's simulate all the simpler-ops
          (dolist (op (get-simpler-operations-from op1 wc))
            (simulate-neighborhood-operation op wc))

          (pp-solution wc t)

          (format t "Now let's simulate the second selection:~%")
          ;; the simulation of the operation
          (dolist (op (get-simpler-operations-from op2 wc))
            (simulate-neighborhood-operation op wc))
          (pp-solution wc t)

          (format t "Now let's simulate the swap~%")
          (dolist (op (get-simpler-operations-from op3 wc))
            (simulate-neighborhood-operation op wc))

          (format t "Solution after the swap:~%")
          (pp-solution wc t)

     
          (format t "Let's undo the swap~%")
          (dolist (op (reverse (get-simpler-operations-from op3 wc)))
            (undo-neighborhood-operation op wc))

          (format t "Solution after undoing the swap:~%")
          (pp-solution wc t)

          (format t "Let's undo the second selection~%")
          (dolist (op (reverse (get-simpler-operations-from op2 wc)))
            (undo-neighborhood-operation op wc))
          (format t "Solution after undoing the second selection:~%")
          (pp-solution wc t)


          (format t "Let's undo the first selection~%")
          (dolist (op (reverse (get-simpler-operations-from op1 wc)))
            (undo-neighborhood-operation op wc))
          (format t "Solution after undoing the first selection:~%")
          (pp-solution wc t)

     
         )))
      #+END_SRC

     #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now the working-copy:
      S1:
          R1: (1, 2, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Let's simulate the solution (check that the 2 is missing):
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Now let's simulate the second selection:
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 8)
      Now let's simulate the swap
      Solution after the swap:
      S1:
          R1: (1, 7, 3)
          R2: (4, 5)
          R3: (6, 2, 8)
      Let's undo the swap
      Solution after undoing the swap:
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 8)
      Let's undo the second selection
      Solution after undoing the second selection:
      S1:
          R1: (1, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      Let's undo the first selection
      Solution after undoing the first selection:
      S1:
          R1: (1, 2, 3)
          R2: (4, 5)
          R3: (6, 7, 8)
      #+end_example
** applying an operation
   So far we have just simulated the operations, but if we want, we can apply the operations to a working-copy and then we can obtain a new solution.

   Let's see that.
   #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
   (with-basic-solution (s1 ((1 2 3)
                             (4 5)
                             (6 7 8)))
     (bformat t "Creating a basic-working-copy")
     (let* ((wc (basic-working-copy s1)
              ;; we just created the working-copy
                 ))

       (let* ((op1 (op-select-client 1 2 0)) ;; the selection
              (op2 (op-select-client 3 2 1)) ;; the insertion
              (op3 (op-swap-clients 0 1)) ;; the swap
              ;; it only receives the indices of the
              ;; selections that should be swapped
              )

         ;; let's print the working-copy
         ;; we can use the function
         ;; pp-solution
         (prepare-solution-for-neighborhood-exploration wc)
         (format t "Now the working-copy:~%")
         (pp-solution wc t)
         ;; let's simulate the solution
         (format t "Let's simulate the solution (check that the 2 is missing):~%")
         ;; instead of simulating the operation
         ;; let's simulate all the simpler-ops
         (dolist (op (get-simpler-operations-from op1 wc))
           (simulate-neighborhood-operation op wc))

         (pp-solution wc t)

         (format t "Now let's simulate the second selection:~%")
         ;; the simulation of the operation
         (dolist (op (get-simpler-operations-from op2 wc))
           (simulate-neighborhood-operation op wc))
         (pp-solution wc t)

         (format t "Now let's simulate the swap~%")
         (dolist (op (get-simpler-operations-from op3 wc))
           (simulate-neighborhood-operation op wc))

         (format t "Solution after the swap:~%")
         (pp-solution wc t)

         ;; here we can get the solution from which
         ;; the working-copy was created.
         ;; We can do that with the =solution= method.
         (format t "And this was the original solution: ~%")
         (pp-solution (solution wc) t)

         )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      ===============================
       Creating a basic-working-copy
      ===============================

      Now the working-copy:
      S1:
	  R1: (1, 2, 3)
	  R2: (4, 5)
	  R3: (6, 7, 8)
      Let's simulate the solution (check that the 2 is missing):
      S1:
	  R1: (1, 3)
	  R2: (4, 5)
	  R3: (6, 7, 8)
      Now let's simulate the second selection:
      S1:
	  R1: (1, 3)
	  R2: (4, 5)
	  R3: (6, 8)
      Now let's simulate the swap
      Solution after the swap:
      S1:
	  R1: (1, 7, 3)
	  R2: (4, 5)
	  R3: (6, 2, 8)
      And this was the original solution: 
      S1:
	  R1: (1, 2, 3)
	  R2: (4, 5)
	  R3: (6, 7, 8)
      #+end_example
      
   Now, let's apply the operations so we can get a new solution.
   #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
   (with-basic-solution (s1 ((1 2 3)
                             (4 5)
                             (6 7 8)))
     (bformat t "Creating a basic-working-copy")
     (let* ((wc (basic-working-copy s1)
              ;; we just created the working-copy
                 ))

       (let* ((op1 (op-select-client 1 2 0)) ;; the selection
              (op2 (op-select-client 3 2 1)) ;; the insertion
              (op3 (op-swap-clients 0 1)) ;; the swap
              ;; it only receives the indices of the
              ;; selections that should be swapped
              (list-with-all-the-operations nil)
              )

         ;; let's print the working-copy
         ;; we can use the function
         ;; pp-solution
         (prepare-solution-for-neighborhood-exploration wc)
         (format t "Now the working-copy:~%")
         (pp-solution wc t)
         ;; let's simulate the solution
         (format t "Let's simulate the solution (check that the 2 is missing):~%")
         ;; instead of simulating the operation
         ;; let's simulate all the simpler-ops
         (dolist (op (get-simpler-operations-from op1 wc))
           (simulate-neighborhood-operation op wc)
           (push op list-with-all-the-operations))

         (pp-solution wc t)

         (format t "Now let's simulate the second selection:~%")
         ;; the simulation of the operation
         (dolist (op (get-simpler-operations-from op2 wc))
           (simulate-neighborhood-operation op wc)
           (push op list-with-all-the-operations))
         (pp-solution wc t)

         (format t "Now let's simulate the swap~%")
         (dolist (op (get-simpler-operations-from op3 wc))
           (simulate-neighborhood-operation op wc)
           (push op list-with-all-the-operations))

         (format t "Solution after the swap:~%")
         (pp-solution wc t)

         ;; here we can get the solution from which
         ;; the working-copy was created.
         ;; We can do that with the =solution= method.
         (format t "And this was the original solution: ~%")
         (pp-solution (solution wc) t)

         (format t "List with all the operations:~%~a~2%"
                 list-with-all-the-operations)


         (format t "Here we apply the operations...~%")
         ;; now let's apply the operations
         ;; for that we have a function:
         ;; apply-set-of-operations
         (apply-set-of-operations
          ;; we need to reverse the list-with-all-the-operations
          ;; because they were pushed instead
          ;; of appended
          (reverse list-with-all-the-operations)
          wc)

         (format t "And this is now the solution we have in the working-copy~%")
         (pp-solution (solution wc) t)



         )))
   #+END_SRC

   #+RESULTS:
   #+begin_example
   ===============================
    Creating a basic-working-copy
   ===============================

   Now the working-copy:
   S1:
       R1: (1, 2, 3)
       R2: (4, 5)
       R3: (6, 7, 8)
   Let's simulate the solution (check that the 2 is missing):
   S1:
       R1: (1, 3)
       R2: (4, 5)
       R3: (6, 7, 8)
   Now let's simulate the second selection:
   S1:
       R1: (1, 3)
       R2: (4, 5)
       R3: (6, 8)
   Now let's simulate the swap
   Solution after the swap:
   S1:
       R1: (1, 7, 3)
       R2: (4, 5)
       R3: (6, 2, 8)
   And this was the original solution: 
   S1:
       R1: (1, 2, 3)
       R2: (4, 5)
       R3: (6, 7, 8)
   List with all the operations:
   (<op:b 3 2 0> <op:b 1 2 1> <op:a 3 2 1> <op:a 1 2 0>)

   Here we apply the operations...
   And this is now the solution we have in the working-copy
   S1:
       R1: (1, 7, 3)
       R2: (4, 5)
       R3: (6, 2, 8)
   #+end_example

   We usually use this, when we have already found a new neighbor, or something like that.
** Let's explore several neighbors
   Let's write a code to select a client from the first route, but let's select from all the possible positions.

     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3 4)
                               (5)
                               (6 7 8)))
       (bformat t "Selecting a client from the 1st route")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* () ;; we don't need any variable

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "This is the original solution:~%")
          (pp-solution wc t)

          (format t "Let's start the selections~2%")
          ;; let's iterate through all the possible
          ;; positions for the selection
          (loop for pos from 1 to 4
                ;; let's create the selection
                ;; from route 1 and position pos
                ;; and the index always 0
                for op = (op-select-client 1 pos 0)
                doing (progn 
                        ;; let's simulate the operation
                        (dolist (ops (get-simpler-operations-from
                                      op wc))
                          (simulate-neighborhood-operation ops wc))

                        (format t "Selecting client from position: ~a~%"
                                pos)
                        (pp-solution wc t)
                        ;; print a newline
                        (format t "~%"))

                ;; we need to undo the simulation :-o
                doing (progn
                        (dolist (ops
                                  (reverse
                                   (get-simpler-operations-from op wc)))
                          (undo-neighborhood-operation ops wc))))





         )))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      =======================================
       Selecting a client from the 1st route
      =======================================

      This is the original solution:
      S1:
          R1: (1, 2, 3, 4)
          R2: (5)
          R3: (6, 7, 8)
      Let's start the selections

      Selecting client from position: 1
      S1:
          R1: (2, 3, 4)
          R2: (5)
          R3: (6, 7, 8)

      Selecting client from position: 2
      S1:
          R1: (1, 3, 4)
          R2: (5)
          R3: (6, 7, 8)

      Selecting client from position: 3
      S1:
          R1: (1, 2, 4)
          R2: (5)
          R3: (6, 7, 8)

      Selecting client from position: 4
      S1:
          R1: (1, 2, 3)
          R2: (5)
          R3: (6, 7, 8)

      #+end_example
** let's explore the neighborhood 1ab
   In this case, we need to select from the first route, and insert the selected-client into that first route.
     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-basic-solution (s1 ((1 2 3 4)
                               (5)
                               (6 7 8)))
       (bformat t "Selecting a client from the 1st route")
       (let* ((wc (basic-working-copy s1)
                ;; we just created the working-copy
                ))

         (let* () ;; we don't need any variable

          ;; let's print the working-copy
          ;; we can use the function
          ;; pp-solution
          (prepare-solution-for-neighborhood-exploration wc)
          (format t "This is the original solution:~%")
          (pp-solution wc t)

          (format t "Let's start the selections~2%")
          ;; let's iterate through all the possible
          ;; positions for the selection
          (loop for pos from 1 to 4
                ;; let's create the selection
                ;; from route 1 and position pos
                ;; and the index always 0
                for op = (op-select-client 1 pos 0)
                doing (progn 
                        ;; let's simulate the operation
                        (dolist (ops (get-simpler-operations-from
                                      op wc))
                          (simulate-neighborhood-operation ops wc)))
           
                do (loop ;; over the posible insert positions
                         for insert-pos from 1 to 4
                         ;; creating an insertion
                         for ins-op = (op-insert-client 1 insert-pos 0)
                         do (progn 
                              ;; let's simulate the operation
                              (dolist (ops (get-simpler-operations-from
                                            ins-op wc))
                                (simulate-neighborhood-operation ops wc)))
                         ;; here we'll do what the user wants
                         ;; in this case, let's print the solution
                         do (progn
                              (format t "Selecting client from position: ~a
     and inserting it at pos ~a~%"
                                     pos insert-pos)
                             (pp-solution wc t)
                             ;; print a newline
                             (format t "~%"))
                         ;; let's undo the insertion
                         do (dolist (ops
                                      (reverse
                                       (get-simpler-operations-from
                                        ins-op wc)))
                              (undo-neighborhood-operation ops wc)))

                ;; we need to undo the simulation :-o
                doing (progn
                        (dolist (ops
                                  (reverse
                                   (get-simpler-operations-from op wc)))
                          (undo-neighborhood-operation ops wc)))))))
      #+END_SRC

      #+RESULTS:
      #+begin_example
      =======================================
       Selecting a client from the 1st route
      =======================================

      This is the original solution:
      S1:
	  R1: (1, 2, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)
      Let's start the selections

      Selecting client from position: 1
      and inserting it at pos 1
      S1:
	  R1: (1, 2, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 1
      and inserting it at pos 2
      S1:
	  R1: (2, 1, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 1
      and inserting it at pos 3
      S1:
	  R1: (2, 3, 1, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 1
      and inserting it at pos 4
      S1:
	  R1: (2, 3, 4, 1)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 2
      and inserting it at pos 1
      S1:
	  R1: (2, 1, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 2
      and inserting it at pos 2
      S1:
	  R1: (1, 2, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 2
      and inserting it at pos 3
      S1:
	  R1: (1, 3, 2, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 2
      and inserting it at pos 4
      S1:
	  R1: (1, 3, 4, 2)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 3
      and inserting it at pos 1
      S1:
	  R1: (3, 1, 2, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 3
      and inserting it at pos 2
      S1:
	  R1: (1, 3, 2, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 3
      and inserting it at pos 3
      S1:
	  R1: (1, 2, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 3
      and inserting it at pos 4
      S1:
	  R1: (1, 2, 4, 3)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 4
      and inserting it at pos 1
      S1:
	  R1: (4, 1, 2, 3)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 4
      and inserting it at pos 2
      S1:
	  R1: (1, 4, 2, 3)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 4
      and inserting it at pos 3
      S1:
	  R1: (1, 2, 4, 3)
	  R2: (5)
	  R3: (6, 7, 8)

      Selecting client from position: 4
      and inserting it at pos 4
      S1:
	  R1: (1, 2, 3, 4)
	  R2: (5)
	  R3: (6, 7, 8)

      #+end_example

*** the class basic-route has a slot named id
    So when you want to iterate through a route, you can use that property.

    For instance, to print the id of the routes in a solution, we can do something like:
    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (loop for r in (routes s1)
        ;; read the syntax for loop
            do (format t "route id: ~a~%" (id r))))
    #+END_SRC

    #+RESULTS:
    : route id: 1
    : route id: 2
    : route id: 3

    But we can use the power of the loop macro and do something like:

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (loop for r in (routes s1)
            for id = (id r)
            do (format t "route id: ~a~%" id)))
    #+END_SRC

    #+RESULTS:
    : route id: 1
    : route id: 2
    : route id: 3
*** the class basic-route doesn't have a property route-length
    So if we want to know how many elements are there in a route, we need to =(length (clients route))=.

    Let's check if that work.
    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (loop for r in (routes s1)
        ;; read the syntax for loop
            do (format t "length of route ~a: ~a~%"
                       (id r) (length (clients r)))))
    #+END_SRC

    #+RESULTS:
    : length of route 1: 3
    : length of route 2: 2
    : length of route 3: 3
** the powerful macros
   There are some macros that hide all the complexity of the insertion, selection, and any other operations.  These are the =doneighborhood-macros=.

   Some of them are:

    - doselect-route
    - doselect-client
    - doinsert-client
    - doswap-clients

    They all receive the parameters required for the operation (in the case of a selection: the route and the position, for the swap, the two clients that should be swapped, and so on).

    This is how you can use it:
    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (let* ((wc (basic-working-copy s1)))
        (prepare-solution-for-neighborhood-exploration wc)
        (doselect-route (r wc)
          (format t "Selecting route: ~a~%" r))))
    #+END_SRC

    Before using any macro (other than doselect-route) we need to initialize a variable called ops-list.

    Another example: this time will be the rab criterion.
    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3)
                              (4 5)
                              (6 7 8)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (let* ((wc (basic-working-copy s1))
             (ops-list nil))
        (prepare-solution-for-neighborhood-exploration wc)

        (bformat t "Testing rab with the macros.")
    
        (doselect-route (r wc)
          (doselect-client (c1 r wc)
            (doinsert-client (c1 r wc)
              (pp-solution wc t))))))
    #+END_SRC

    #+RESULTS:
    #+begin_example
    ==============================
     Testing rab with the macros.
    ==============================

    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (2, 1, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (2, 3, 1)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (2, 1, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 3, 2)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (3, 1, 2)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 3, 2)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (5, 4)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (5, 4)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (7, 6, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (7, 8, 6)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (7, 6, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 8, 7)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (8, 6, 7)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 8, 7)
    S1:
	R1: (1, 2, 3)
	R2: (4, 5)
	R3: (6, 7, 8)
    #+end_example

    There also are the random-neighborhood macros.  They are just like the =doneighborhood-macros=, but instead of iterating through all the possible neighbors, they just select a random one.

    #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
    (with-basic-solution (s1 ((1 2 3 4 5)
                              (6 7 8 9 10 11)))
      ;; code here
      ;; where you car reference a basic-solution s1
      ;; for instance, we can just print it
      (let* ((wc (basic-working-copy s1))
             (ops-list nil))
        (prepare-solution-for-neighborhood-exploration wc)

        (bformat t "Testing rab with the macros.")

        (random-select-route (r wc)
          (random-select-client (c1 r wc)
            (random-insert-client (c1 r wc)
              (pp-solution wc t))))))
    #+END_SRC
** some extra info stored by the macros

   The do-neighborhood-macros store some useful information while they run.  For instance, we can refer to the selection-coordinates of a selected client as well as the insertion coordinates.  This is shown in the following example:
   
     #+BEGIN_SRC lisp +n -r :results output :exports both.lisp
     (with-cvrp-problem (p1 :distances `((0 2 3 4 5 6)  ;0
                                         (5 0 6 7 2 4)  ;1
                                         (1 8 0 3 9 1)  ;2
                                         (4 5 1 0 5 7)  ;3
                                         (4 5 1 5 0 6)  ;4
                                         (1 5 7 6 9 0)) ;5
                                         ;0 1 2 3 4 5 
                                         :demands '(10 10 15 40 20)
                                         :capacity 40)
        (with-basic-cvrp-solution (s1 ((2 4 5) (3) (1)) p1)

          ;; code here
          ;; where you can reference a basic-cvrp-solution s1
          ;; and a cvrp-problem p1
          (let* ((wc (basic-working-copy s1))
                 (ops-list nil))
            (prepare-solution-for-neighborhood-exploration wc)

            (bformat t "Testing rab with the macros.")

            (doselect-route (r wc)
              (doselect-client (c1 r wc)
                (doinsert-client (c1 r wc)
                  (format t "select from: (~a,~a) and insert in (~a, ~a)~%"
                          c1.route c1.position
                          c1.insert.route c1.ins.pos)))))))
     #+END_SRC

     #+RESULTS:
     #+begin_example
     ==============================
      Testing rab with the macros.
     ==============================

     select from: (1,1) and insert in (1, 1)
     select from: (1,1) and insert in (1, 2)
     select from: (1,1) and insert in (1, 3)
     select from: (1,2) and insert in (1, 1)
     select from: (1,2) and insert in (1, 2)
     select from: (1,2) and insert in (1, 3)
     select from: (1,3) and insert in (1, 1)
     select from: (1,3) and insert in (1, 2)
     select from: (1,3) and insert in (1, 3)
     select from: (2,1) and insert in (2, 1)
     select from: (3,1) and insert in (3, 1)
     #+end_example

**** testing the generated code from the inheritance

    And here we can see the generated code so far, with an exhaustive-search.  As we want to use the smart-macros, we need to use the instance class =*exhaustive-search-strategy*=.

    #+BEGIN_SRC lisp +n -r :results output :exports both :tangle ../src/vrp-tests.lisp
    (let* ((*vrp-unit-testing-display-output* nil)
           (*vrp-unit-testing-display-results* t)
           (bp1 (basic-strategy-blueprint))
           (code1 `((select-route r1)
                    (select-client c1 from r1)
                    (insert-client c1 into r1)))
           )

      ;; let's populate the blueprint
      (prepare-blueprint-for-code-generation
       code1
       ,*exhaustive-search-strategy*
       (make-instance 'count-better-neighbors)
       bp1)

      (format t "the generated code:~%~a~%"
              (write-neighborhood-exploration-code bp1)))
    #+END_SRC

    #+RESULTS:
    #+begin_example
    the generated code:
    (LAMBDA (SOLUTION PROBLEM ACTION &OPTIONAL (INITIAL-BEST-DELTA-COST 0))
      (DECLARE (IGNORABLE INITIAL-BEST-DELTA-COST SOLUTION PROBLEM ACTION))
      (LET* ((*VRP-STOP-NEIGHBORHOOD-SEARCH* NIL) (OPS-LIST NIL))
        (PREPARE-SOLUTION-FOR-NEIGHBORHOOD-EXPLORATION WC)
        (INITIALIZE-ACTION-FOR-DELTA-COST-COMPUTATION WC PROBLEM ACTION)
        (DOSELECT-ROUTE* (R1 WC)
          (DOSELECT-CLIENT* (C1 R1 WC)
            (DOINSERT-CLIENT* (C1 R1 WC))))
        (VALUES)))
    #+end_example
